Tekla Open API Reference for Tekla Structures 2025
PrintAttributes Methods
The PrintAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
PrintAttributes Class
Tekla.Structures.Drawing Namespace